lequangthinhhaui/modbus_stm32/FreeModbus_Slave-Master/RTU/HARDWARE/FreeModbus/modbus/include/mbconfig.h
/* 
 * FreeModbus Libary: A portable Modbus implementation for Modbus ASCII/RTU.
 * Copyright (c) 2006 Christian Walter <wolti@sil.at>
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 * 3. The name of the author may not be used to endorse or promote products
 *    derived from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
 * IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
 * NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
 * THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 * File: $Id: mbconfig.h,v 1.14 2006/12/07 22:10:34 wolti Exp $
 *       $Id: mbconfig.h,v 1.60 2013/08/13 21:19:55 Armink Add Master Functions $
 */

#ifndef _MB_CONFIG_H
#define _MB_CONFIG_H

#ifdef __cplusplus
PR_BEGIN_EXTERN_C
#endif
/* ----------------------- Defines ------------------------------------------*/
/*! \defgroup modbus_cfg Modbus Configuration
 *
 * Most modules in the protocol stack are completly optional and can be
 * excluded. This is specially important if target resources are very small
 * and program memory space should be saved.<br>
 *
 * All of these settings are available in the file <code>mbconfig.h</code>
 */
/*! \addtogroup modbus_cfg
 *  @{
 */
/*! \brief If Modbus Master ASCII support is enabled. */
#define MB_MASTER_ASCII_ENABLED                 (  0 )
/*! \brief If Modbus Master RTU support is enabled. */
#define MB_MASTER_RTU_ENABLED                   (  0 )
/*! \brief If Modbus Master TCP support is enabled. */
#define MB_MASTER_TCP_ENABLED                   (  0 )
/*! \brief If Modbus Slave ASCII support is enabled. */
#define MB_SLAVE_ASCII_ENABLED                  (  0 )
/*! \brief If Modbus Slave RTU support is enabled. */
#define MB_SLAVE_RTU_ENABLED                    (  1 )
/*! \brief If Modbus Slave TCP support is enabled. */
#define MB_SLAVE_TCP_ENABLED                    (  0 )
/*! \brief The character timeout value for Modbus ASCII.
 *
 * The character timeout value is not fixed for Modbus ASCII and is therefore
 * a configuration option. It should be set to the maximum expected delay
 * time of the network.
 */
#define MB_ASCII_TIMEOUT_SEC                    (  1 )
/*! \brief Maximum number of Modbus functions codes the protocol stack
 *    should support.
 *
 * The maximum number of supported Modbus functions must be greater than
 * the sum of all enabled functions in this file and custom function
 * handlers. If set to small adding more functions will fail.
 */
#define MB_FUNC_HANDLERS_MAX                    ( 16 )
/*! \brief Number of bytes which should be allocated for the <em>Report Slave ID
 *    </em>command.
 *
 * This number limits the maximum size of the additional segment in the
 * report slave id function. See eMBSetSlaveID(  ) for more information on
 * how to set this value. It is only used if MB_FUNC_OTHER_REP_SLAVEID_ENABLED
 * is set to <code>1</code>.
 */
#define MB_FUNC_OTHER_REP_SLAVEID_BUF           ( 32 )
/*! \brief If the <em>Report Slave ID</em> function should be enabled. */
#define MB_FUNC_OTHER_REP_SLAVEID_ENABLED       (  1 )
/*! \brief If the <em>Read Input Registers</em> function should be enabled. */
#define MB_FUNC_READ_INPUT_ENABLED              (  1 )
/*! \brief If the <em>Read Holding Registers</em> function should be enabled. */
#define MB_FUNC_READ_HOLDING_ENABLED            (  1 )
/*! \brief If the <em>Write Single Register</em> function should be enabled. */
#define MB_FUNC_WRITE_HOLDING_ENABLED           (  1 )
/*! \brief If the <em>Write Multiple registers</em> function should be enabled. */
#define MB_FUNC_WRITE_MULTIPLE_HOLDING_ENABLED  (  1 )
/*! \brief If the <em>Read Coils</em> function should be enabled. */
#define MB_FUNC_READ_COILS_ENABLED              (  1 )
/*! \brief If the <em>Write Coils</em> function should be enabled. */
#define MB_FUNC_WRITE_COIL_ENABLED              (  1 )
/*! \brief If the <em>Write Multiple Coils</em> function should be enabled. */
#define MB_FUNC_WRITE_MULTIPLE_COILS_ENABLED    (  1 )
/*! \brief If the <em>Read Discrete Inputs</em> function should be enabled. */
#define MB_FUNC_READ_DISCRETE_INPUTS_ENABLED    (  1 )
/*! \brief If the <em>Read/Write Multiple Registers</em> function should be enabled. */
#define MB_FUNC_READWRITE_HOLDING_ENABLED       (  1 )
/*! @} */
#ifdef __cplusplus
    PR_END_EXTERN_C
#endif

#if MB_MASTER_RTU_ENABLED > 0 || MB_MASTER_ASCII_ENABLED > 0
/*! \brief If master send a broadcast frame,the master will wait time of convert to delay,
 * then master can send other frame */
#define MB_MASTER_DELAY_MS_CONVERT              (200 )
/*! \brief If master send a frame which is not broadcast,the master will wait sometime for slave.
 * And if slave is not respond in this time,the master will process this timeout error.
 * Then master can send other frame */
#define MB_MASTER_TIMEOUT_MS_RESPOND            (100 )
/*! \brief The total slaves in Modbus Master system. Default 16.
 * \note : The slave ID must be continuous from 1.*/
#define MB_MASTER_TOTAL_SLAVE_NUM               ( 16 )
#endif
///////////////////////////////////////////////////////////////////////////////////////
#include "stm32f1xx_hal.h"

#include <assert.h>
#include <inttypes.h>
typedef uint8_t BOOL;

typedef unsigned char UCHAR;
typedef char    CHAR;

typedef uint16_t USHORT;
typedef int16_t SHORT;

typedef uint32_t ULONG;
typedef int32_t LONG;

////typedef char    BOOL;
//// 
////typedef unsigned char UCHAR;
//// 
////typedef char    CHAR;
//// 
////typedef unsigned short USHORT;
////typedef short   SHORT;
//// 
////typedef unsigned long ULONG;
////typedef long    LONG;

typedef enum
{
    REG_INPUT,
    REG_HOLDING,
    DESCRETE_IP,
    COIL_OP
} MB_Data_Type;
 
 
typedef enum
{
    ACCESS_ADDR_ERR,
    ACCESS_NO_ERR,
    ACCESS_WRONG_DATA_TYPE
} eMBAccessDataCode;


eMBAccessDataCode S_MBSetCoil(USHORT bitOfset, char value);
eMBAccessDataCode S_MBGetCoil(USHORT bitOfset, UCHAR *GetValue);
eMBAccessDataCode S_MBSetDescretesInputbit(USHORT bitOfset, char value);
eMBAccessDataCode S_MBGetDescretesInputbit(USHORT bitOfset, UCHAR* GetValue);
 

eMBAccessDataCode S_MBGetData16Bits(MB_Data_Type DataType, USHORT Address, USHORT* Value);
eMBAccessDataCode S_MBGetData32Bits(MB_Data_Type DataType, USHORT Address, ULONG* Value);
 
eMBAccessDataCode S_MBSetData16Bits(MB_Data_Type DataType, USHORT Address, USHORT Value);
eMBAccessDataCode S_MBSetData32Bits(MB_Data_Type DataType, USHORT Address, ULONG Value);
 
eMBAccessDataCode S_MBSetFloatData(MB_Data_Type DataType, USHORT Address, float Value);
eMBAccessDataCode S_MBGetFloatData(MB_Data_Type DataType, USHORT Address, float* Value);

//////////////////////MASTER/////////////////////

eMBAccessDataCode M_MBSetCoil(USHORT bitOfset, char value);
eMBAccessDataCode M_MBGetCoil(USHORT bitOfset, UCHAR *GetValue);
eMBAccessDataCode M_MBSetDescretesInputbit(USHORT bitOfset, char value);
eMBAccessDataCode M_MBGetDescretesInputbit(USHORT bitOfset, UCHAR* GetValue);
 

eMBAccessDataCode M_MBGetData16Bits(MB_Data_Type DataType, USHORT Address, USHORT* Value);
eMBAccessDataCode M_MBGetData32Bits(MB_Data_Type DataType, USHORT Address, ULONG* Value);
 
eMBAccessDataCode M_MBSetData16Bits(MB_Data_Type DataType, USHORT Address, USHORT Value);
eMBAccessDataCode M_MBSetData32Bits(MB_Data_Type DataType, USHORT Address, ULONG Value);
 
eMBAccessDataCode M_MBSetFloatData(MB_Data_Type DataType, USHORT Address, float Value);
eMBAccessDataCode M_MBGetFloatData(MB_Data_Type DataType, USHORT Address, float* Value);
 
//////////////////////////////////////////////////////////////////////////////////////////////// 

#endif
